[AdventPurifierArmor X2ArmorTemplate]
FriendlyName="变种人净化者护甲"
FriendlyNamePlural="变种人净化者护甲"
BriefSummary="净化者护甲可能是我们从变种人军队中获得的最厚重的一件盔甲。它的厚板加上一层绝缘层，使它完全不受热、火、酸和毒的影响。此外，就像变种人军官一样，净化者能够装备一个手榴弹在内部隔间。然而，装备如此厚重的盔甲有一个缺点。它的重量和存储容量的增加对移动性有负面影响。"
TacticalText="<Bullet/>净化者护甲可能是我们从变种人军队中获得的最厚重的一件盔甲。它的厚板加上一层绝缘层，使它完全不受热、火、酸和毒的影响。此外，就像变种人军官一样，净化者能够装备一个手榴弹在内部隔间。然而，装备如此厚重的盔甲有一个缺点。它的重量和存储容量的增加对移动性有负面影响。"


[AdventPurifierArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="欺骗"
LocLongDescription="变种人在初次接敌中将不太可能发现这个士兵。"
LocHelpText="变种人在初次接敌中将不太可能发现这个士兵。"
LocFlyOverText="变种人在初次接敌中将不太可能发现这个士兵。"
LocPromotionPopupText="<Bullet/> 变种人在初次接敌中将不太可能发现这个士兵。"


[AdventPurifierArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="绝缘保护层"
LocLongDescription="净化者护甲以牺牲机动性为代价，获得了对各种元素的免疫和额外的实用插槽。"
LocHelpText="净化者护甲以牺牲机动性为代价，获得了对各种元素的免疫和额外的实用插槽。"
LocFlyOverText="净化者护甲以牺牲机动性为代价，获得了对各种元素的免疫和额外的实用插槽。"
LocPromotionPopupText="<Bullet/> 净化者护甲以牺牲机动性为代价，获得了对各种元素的免疫和额外的实用插槽。"
